Revit 2027 API
ComboBoxMember.GroupName Property
The group to which the ComboBoxMember is assigned.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GroupName { get; }
Public ReadOnly Property GroupName As String
	Get
public:
property String^ GroupName {
	String^ get ();
}
member GroupName : string with get
Property Value
String
Remarks
If set, the ComboBoxMember appears under a group header in the ComboBox. If null, the ComboBoxMember is not a member of any group. The default value is null.
See Also
Reference
ComboBoxMember Class
Autodesk.Revit.UI Namespace